<section class="o-section c-section--hero p-0 relative">
	<div class="c-hero">
		<div class="before-top-img">
			<img src="<?php echo get_template_directory_uri(); ?>/assets/images/top-before.svg"
				 alt="برقآپ">
		</div>
		<div class="c-hero__slider lightning-before d-flex items-end content-center">
			<div class="c-slider-content w-100">
				<div class="o-section__wrapper">
					<div class="tabs c-slider-main">
						<div class="tab-buttons absolute">
							<button class="tab-btn flex-1 active"
								data-tab="tab1">
								<span class="u-flex gap-md items-center u-flex--column justify-center h-100 w-100 space-between">
								<svg width="68" height="68" viewBox="0 0 80 93" fill="none"
									 xmlns="http://www.w3.org/2000/svg">
									<path
										d="M40.5 74.6936C39.1333 74.6936 38 73.3948 38 71.8286V63.8063C38 62.2401 39.1333 60.9413 40.5 60.9413C41.8667 60.9413 43 62.2401 43 63.8063V71.8286C43 73.3948 41.8667 74.6936 40.5 74.6936Z"
										fill="#767676"/>
									<path
										d="M59.6667 87.682H21.3333V80.9968C21.3333 75.1902 25.4333 70.4915 30.5 70.4915H50.5C55.5667 70.4915 59.6667 75.1902 59.6667 80.9968V87.682ZM26.3333 81.9518H54.6667V80.9968C54.6667 78.3609 52.8 76.2217 50.5 76.2217H30.5C28.2 76.2217 26.3333 78.3609 26.3333 80.9968V81.9518Z"
										fill="#767676"/>
									<path
										d="M60.5 87.682H20.5C19.1333 87.682 18 86.3832 18 84.8169C18 83.2507 19.1333 81.9518 20.5 81.9518H60.5C61.8667 81.9518 63 83.2507 63 84.8169C63 86.3832 61.8667 87.682 60.5 87.682Z"
										fill="#767676"/>
									<path
										d="M61.4333 48.2967C60.7333 48.2967 60.0333 47.9529 59.5333 47.3035C58.9 46.4631 58.7333 45.2788 59.1333 44.2856C60.2667 41.3059 60.8333 38.1352 60.8333 34.8117V23.3514C60.8333 22.0144 60.6333 20.7156 60.2333 19.3403C60.2 19.2257 60.1667 19.0729 60.1333 18.9201C60.0333 18.3471 60 17.7741 60 17.2393C60 15.673 61.1333 14.3742 62.5 14.3742H64.5C70.4667 14.3742 75.3333 20.1043 75.3333 27.1715C75.3333 33.0163 73.2333 38.7847 69.6 42.9486C69.5333 43.025 69.3333 43.216 69.3 43.2542C67.3333 45.126 65.1 47.2271 62.1 48.1821C61.8667 48.2585 61.6667 48.2967 61.4333 48.2967ZM65.6 20.2189C65.7667 21.2504 65.8333 22.32 65.8333 23.3514V34.8117C65.8333 36.378 65.7333 37.8678 65.5333 39.3959C65.7333 39.2049 65.9 39.0521 66.1 38.8611C68.7667 35.805 70.3333 31.5264 70.3333 27.1715C70.3333 23.7334 68.3 20.8302 65.6 20.2189Z"
										fill="#767676"/>
									<path
										d="M18.6 48.1439C18.3333 48.1439 18.1 48.1057 17.8333 47.9911C15.1 46.9979 12.5333 45.1642 10.4 42.7194C6.56666 37.8678 4.66666 32.5579 4.66666 26.9423C4.66666 19.9897 9.43332 14.527 15.5 14.527H17.6667C18.5 14.527 19.3 15.0236 19.7667 15.8258C20.2333 16.628 20.3 17.6595 19.9667 18.5381C19.4333 19.9133 19.1667 21.4796 19.1667 23.1222V34.5825C19.1667 37.8678 19.7333 41.0767 20.9 44.1328C21.3 45.1642 21.1 46.3485 20.4667 47.1889C19.9667 47.8001 19.3 48.1439 18.6 48.1439ZM14.3333 20.3717C11.6333 20.983 9.66666 23.657 9.66666 26.9423C9.66666 31.1062 11.1333 35.1173 14.0333 38.7846C14.1667 38.9757 14.3333 39.1285 14.5 39.2813C14.2667 37.715 14.1667 36.1488 14.1667 34.5825V23.1222C14.1667 22.2054 14.2333 21.2886 14.3333 20.3717Z"
										fill="#767676"/>
									<path
										d="M40 64.7614C25.7667 64.7614 14.1667 51.4674 14.1667 35.1555V23.6952C14.1667 13.6866 21.2667 5.54973 30 5.54973H50C58.7333 5.54973 65.8333 13.6866 65.8333 23.6952V35.1555C65.8333 51.4674 54.2333 64.7614 40 64.7614ZM30 11.2799C24.0333 11.2799 19.1667 16.8572 19.1667 23.6952V35.1555C19.1667 48.3349 28.5 59.0312 40 59.0312C51.5 59.0312 60.8333 48.3349 60.8333 35.1555V23.6952C60.8333 16.8572 55.9667 11.2799 50 11.2799H30Z"
										fill="#767676"/>
								</svg>
	برقآپ پلاس
									</span>
							</button>
							<button class="tab-btn flex-1"
									data-tab="tab2">
								<span class="u-flex gap-md items-center u-flex--column justify-center h-100 w-100 space-between"><svg width="68" height="68" viewBox="0 0 80 80" fill="none"
										   xmlns="http://www.w3.org/2000/svg">
									<path
										d="M50 75.8334H30C11.9 75.8334 4.16666 68.1 4.16666 50V30C4.16666 11.9 11.9 4.16669 30 4.16669H50C68.1 4.16669 75.8333 11.9 75.8333 30V50C75.8333 68.1 68.1 75.8334 50 75.8334ZM30 9.16669C14.6333 9.16669 9.16666 14.6334 9.16666 30V50C9.16666 65.3667 14.6333 70.8334 30 70.8334H50C65.3667 70.8334 70.8333 65.3667 70.8333 50V30C70.8333 14.6334 65.3667 9.16669 50 9.16669H30Z"
										fill="#767676"/>
									<path
										d="M51.6667 35C47.5333 35 44.1667 31.6333 44.1667 27.5C44.1667 23.3667 47.5333 20 51.6667 20C55.8 20 59.1667 23.3667 59.1667 27.5C59.1667 31.6333 55.8 35 51.6667 35ZM51.6667 25C50.3 25 49.1667 26.1333 49.1667 27.5C49.1667 28.8667 50.3 30 51.6667 30C53.0333 30 54.1667 28.8667 54.1667 27.5C54.1667 26.1333 53.0333 25 51.6667 25Z"
										fill="#767676"/>
									<path
										d="M28.3333 35C24.2 35 20.8333 31.6333 20.8333 27.5C20.8333 23.3667 24.2 20 28.3333 20C32.4667 20 35.8333 23.3667 35.8333 27.5C35.8333 31.6333 32.4667 35 28.3333 35ZM28.3333 25C26.9667 25 25.8333 26.1333 25.8333 27.5C25.8333 28.8667 26.9667 30 28.3333 30C29.7 30 30.8333 28.8667 30.8333 27.5C30.8333 26.1333 29.7 25 28.3333 25Z"
										fill="#767676"/>
									<path
										d="M40 64.8333C30.3333 64.8333 22.5 56.9666 22.5 47.3333C22.5 44.3 24.9667 41.8333 28 41.8333H52C55.0333 41.8333 57.5 44.3 57.5 47.3333C57.5 56.9666 49.6667 64.8333 40 64.8333ZM28 46.8333C27.7333 46.8333 27.5 47.0666 27.5 47.3333C27.5 54.2333 33.1 59.8333 40 59.8333C46.9 59.8333 52.5 54.2333 52.5 47.3333C52.5 47.0666 52.2667 46.8333 52 46.8333H28V46.8333Z"
										fill="#767676"/>
								</svg>
	برقآپ اکو
</span>
							</button>
							<button class="tab-btn flex-1"
									data-tab="tab3">
						<span class="u-flex gap-md items-center u-flex--column justify-center h-100 w-100 space-between">
							<svg width="68" height="68" viewBox="0 0 80 80" fill="none"
										   xmlns="http://www.w3.org/2000/svg">
									<path
										d="M28.9 75.8334H6.66666C5.29999 75.8334 4.16666 74.7 4.16666 73.3334V53.3334C4.16666 48.2667 8.26666 44.1667 13.3333 44.1667H28.9C30.2667 44.1667 31.4 45.3 31.4 46.6667V73.3334C31.4 74.7 30.2667 75.8334 28.9 75.8334ZM9.16666 70.8334H26.4V49.1667H13.3333C11.0333 49.1667 9.16666 51.0334 9.16666 53.3334V70.8334Z"
										fill="#767676"/>
									<path
										d="M51.1005 75.8333H28.8672C27.5005 75.8333 26.3672 74.7 26.3672 73.3333V40C26.3672 34.9333 30.4672 30.8333 35.5339 30.8333H44.4339C49.5005 30.8333 53.6005 34.9333 53.6005 40V73.3333C53.6005 74.7 52.5005 75.8333 51.1005 75.8333ZM31.4005 70.8333H48.6339V40C48.6339 37.7 46.7672 35.8333 44.4672 35.8333H35.5672C33.2672 35.8333 31.4005 37.7 31.4005 40V70.8333Z"
										fill="#767676"/>
									<path
										d="M73.3336 75.8334H51.1003C49.7336 75.8334 48.6003 74.7 48.6003 73.3334V56.6667C48.6003 55.3 49.7336 54.1667 51.1003 54.1667H66.6669C71.7336 54.1667 75.8336 58.2667 75.8336 63.3334V73.3334C75.8336 74.7 74.7002 75.8334 73.3336 75.8334ZM53.6003 70.8334H70.8336V63.3334C70.8336 61.0334 68.9669 59.1667 66.6669 59.1667H53.6003V70.8334Z"
										fill="#767676"/>
									<path
										d="M45.6663 27.8333C44.8663 27.8333 43.8663 27.5999 42.733 26.9332L39.9996 25.2999L37.2996 26.8999C34.5663 28.5333 32.7663 27.5666 32.0996 27.0999C31.433 26.6333 29.9996 25.1666 30.6996 22.0999L31.333 19.3332L29.0663 17.0666C27.6663 15.6666 27.1663 13.9999 27.6663 12.4665C28.1663 10.9332 29.533 9.86653 31.4663 9.5332L34.3663 9.03322L35.9996 5.76661C37.7996 2.19995 42.1663 2.19995 43.933 5.76661L45.5663 9.03322L48.4663 9.5332C50.3996 9.86653 51.7996 10.9332 52.2663 12.4665C52.7663 13.9999 52.233 15.6666 50.8663 17.0666L48.5996 19.3332L49.233 22.0999C49.933 25.1999 48.4996 26.6333 47.833 27.1333C47.533 27.4 46.7663 27.8333 45.6663 27.8333ZM39.9996 20.2665C40.7996 20.2665 41.5996 20.4666 42.2663 20.8666L44.133 21.9666L43.733 20.1665C43.3996 18.7665 43.8996 17.0666 44.933 16.0332L46.633 14.3332L44.533 13.9666C43.1996 13.7333 41.8996 12.7666 41.2996 11.5666L39.9996 9.06658L38.733 11.5666C38.133 12.7666 36.833 13.7333 35.4996 13.9666L33.3996 14.2999L35.0996 15.9999C36.133 17.0332 36.5996 18.7333 36.2996 20.1333L35.8996 21.9332L37.7663 20.8332C38.3996 20.4332 39.1996 20.2665 39.9996 20.2665Z"
										fill="#767676"/>
								</svg>
									برقآپ پرو
								</span>
							</button>
							<button class="tab-btn flex-1"
									data-tab="tab3">
							<span class="u-flex gap-md items-center u-flex--column justify-center h-100 w-100 space-between">
								<svg width="68" height="68" viewBox="0 0 80 80" fill="none"
									 xmlns="http://www.w3.org/2000/svg">
									<path
										d="M28.9 75.8334H6.66666C5.29999 75.8334 4.16666 74.7 4.16666 73.3334V53.3334C4.16666 48.2667 8.26666 44.1667 13.3333 44.1667H28.9C30.2667 44.1667 31.4 45.3 31.4 46.6667V73.3334C31.4 74.7 30.2667 75.8334 28.9 75.8334ZM9.16666 70.8334H26.4V49.1667H13.3333C11.0333 49.1667 9.16666 51.0334 9.16666 53.3334V70.8334Z"
										fill="#767676"/>
									<path
										d="M51.1005 75.8333H28.8672C27.5005 75.8333 26.3672 74.7 26.3672 73.3333V40C26.3672 34.9333 30.4672 30.8333 35.5339 30.8333H44.4339C49.5005 30.8333 53.6005 34.9333 53.6005 40V73.3333C53.6005 74.7 52.5005 75.8333 51.1005 75.8333ZM31.4005 70.8333H48.6339V40C48.6339 37.7 46.7672 35.8333 44.4672 35.8333H35.5672C33.2672 35.8333 31.4005 37.7 31.4005 40V70.8333Z"
										fill="#767676"/>
									<path
										d="M73.3336 75.8334H51.1003C49.7336 75.8334 48.6003 74.7 48.6003 73.3334V56.6667C48.6003 55.3 49.7336 54.1667 51.1003 54.1667H66.6669C71.7336 54.1667 75.8336 58.2667 75.8336 63.3334V73.3334C75.8336 74.7 74.7002 75.8334 73.3336 75.8334ZM53.6003 70.8334H70.8336V63.3334C70.8336 61.0334 68.9669 59.1667 66.6669 59.1667H53.6003V70.8334Z"
										fill="#767676"/>
									<path
										d="M45.6663 27.8333C44.8663 27.8333 43.8663 27.5999 42.733 26.9332L39.9996 25.2999L37.2996 26.8999C34.5663 28.5333 32.7663 27.5666 32.0996 27.0999C31.433 26.6333 29.9996 25.1666 30.6996 22.0999L31.333 19.3332L29.0663 17.0666C27.6663 15.6666 27.1663 13.9999 27.6663 12.4665C28.1663 10.9332 29.533 9.86653 31.4663 9.5332L34.3663 9.03322L35.9996 5.76661C37.7996 2.19995 42.1663 2.19995 43.933 5.76661L45.5663 9.03322L48.4663 9.5332C50.3996 9.86653 51.7996 10.9332 52.2663 12.4665C52.7663 13.9999 52.233 15.6666 50.8663 17.0666L48.5996 19.3332L49.233 22.0999C49.933 25.1999 48.4996 26.6333 47.833 27.1333C47.533 27.4 46.7663 27.8333 45.6663 27.8333ZM39.9996 20.2665C40.7996 20.2665 41.5996 20.4666 42.2663 20.8666L44.133 21.9666L43.733 20.1665C43.3996 18.7665 43.8996 17.0666 44.933 16.0332L46.633 14.3332L44.533 13.9666C43.1996 13.7333 41.8996 12.7666 41.2996 11.5666L39.9996 9.06658L38.733 11.5666C38.133 12.7666 36.833 13.7333 35.4996 13.9666L33.3996 14.2999L35.0996 15.9999C36.133 17.0332 36.5996 18.7333 36.2996 20.1333L35.8996 21.9332L37.7663 20.8332C38.3996 20.4332 39.1996 20.2665 39.9996 20.2665Z"
										fill="#767676"/>
								</svg>
								برقآپ مارکت
</span>
							</button>
						</div>

						<div class="tab-content active" id="tab1">
							<div class="c-slider-cell w-100 txt-center color-white u-flex items-center space-between">
								<div class="c-hero__img">
									<img src="<?php echo get_template_directory_uri(); ?>/assets/images/battery.png"
										 alt="برقآپ">
								</div>
								<div class="c-hero__desc u-flex--column u-flex gap-md items-center">
									<h2 class="sec-title u-flex u-flex--column gap-sm m-0">
								<span class="txt-before u-flex items-center">
									بـــــــرق آپـــــــــــــــــــــــ
									<img src="<?php echo get_template_directory_uri(); ?>/assets/images/txt-before.svg"
										 alt="برقآپ">
								</span>
										مارکــــــــــــت
										مــحــصـــــــولات و تــولـیـــــــــدات مـــا
									</h2>
									<p class="txt-justify">
										سطرآنچنان که لک است، و برای شرایطو سطرآنچنان که لک است،سطرآنچنان که لک است،لک
										است،سطرآنچنان که لک است، و برای شرایط فعلی ت ن و سطرآنچنان
									</p>
									<img
										src="<?php echo get_template_directory_uri(); ?>/assets/images/mockup-website.png"
										alt="برقآپ">
									<a class="secondary-btn border-radius u-flex items-center gap-sm" href="#">
										ورود به سامانه
										<svg width="24" height="24" viewBox="0 0 40 40" fill="none"
											 xmlns="http://www.w3.org/2000/svg">
											<path
												d="M14.1666 23.75C14.1666 26.95 16.8 29.5833 20 29.5833C23.2 29.5833 25.8333 26.95 25.8333 23.75"
												stroke="white" stroke-width="2.5" stroke-miterlimit="10"
												stroke-linecap="round" stroke-linejoin="round"/>
											<path d="M14.6834 3.33325L8.65002 9.38325" stroke="white" stroke-width="2.5"
												  stroke-miterlimit="10" stroke-linecap="round"
												  stroke-linejoin="round"/>
											<path d="M25.3167 3.33325L31.35 9.38325" stroke="white" stroke-width="2.5"
												  stroke-miterlimit="10" stroke-linecap="round"
												  stroke-linejoin="round"/>
											<path
												d="M3.33325 13.0833C3.33325 10 4.98325 9.75 7.03325 9.75H32.9666C35.0166 9.75 36.6666 10 36.6666 13.0833C36.6666 16.6667 35.0166 16.4167 32.9666 16.4167H7.03325C4.98325 16.4167 3.33325 16.6667 3.33325 13.0833Z"
												stroke="white" stroke-width="2.5"/>
											<path
												d="M5.83325 16.6666L8.18325 31.0666C8.71658 34.3 9.99992 36.6666 14.7666 36.6666H24.8166C29.9999 36.6666 30.7666 34.4 31.3666 31.2666L34.1666 16.6666"
												stroke="white" stroke-width="2.5" stroke-linecap="round"/>
										</svg>

									</a>
								</div>
							</div>
						</div>
						<div class="tab-content" id="tab2">
							<div class="c-slider-cell w-100 txt-center color-white u-flex items-center space-between">
								<div class="c-hero__img">
									<img src="<?php echo get_template_directory_uri(); ?>/assets/images/battery.png"
										 alt="برقآپ">
								</div>
								<div class="c-hero__desc u-flex--column u-flex gap-md items-center">
									<h2 class="sec-title u-flex u-flex--column gap-sm m-0">
								<span class="txt-before u-flex items-center">
									بـــــــرق آپـــــــــــــــــــــــ
									<img src="<?php echo get_template_directory_uri(); ?>/assets/images/txt-before.svg"
										 alt="برقآپ">
								</span>
										مارکــــــــــــت
										مــحــصـــــــولات و تــولـیـــــــــدات مـــا
									</h2>
									<p class="txt-justify">
										سطرآنچنان که لک است، و برای شرایطو سطرآنچنان که لک است،سطرآنچنان که لک است،لک
										است،سطرآنچنان که لک است، و برای شرایط فعلی ت ن و سطرآنچنان
									</p>
									<img
										src="<?php echo get_template_directory_uri(); ?>/assets/images/mockup-website.png"
										alt="برقآپ">
									<a class="secondary-btn border-radius u-flex items-center gap-sm" href="#">
										ورود به سامانه
										<svg width="24" height="24" viewBox="0 0 40 40" fill="none"
											 xmlns="http://www.w3.org/2000/svg">
											<path
												d="M14.1666 23.75C14.1666 26.95 16.8 29.5833 20 29.5833C23.2 29.5833 25.8333 26.95 25.8333 23.75"
												stroke="white" stroke-width="2.5" stroke-miterlimit="10"
												stroke-linecap="round" stroke-linejoin="round"/>
											<path d="M14.6834 3.33325L8.65002 9.38325" stroke="white" stroke-width="2.5"
												  stroke-miterlimit="10" stroke-linecap="round"
												  stroke-linejoin="round"/>
											<path d="M25.3167 3.33325L31.35 9.38325" stroke="white" stroke-width="2.5"
												  stroke-miterlimit="10" stroke-linecap="round"
												  stroke-linejoin="round"/>
											<path
												d="M3.33325 13.0833C3.33325 10 4.98325 9.75 7.03325 9.75H32.9666C35.0166 9.75 36.6666 10 36.6666 13.0833C36.6666 16.6667 35.0166 16.4167 32.9666 16.4167H7.03325C4.98325 16.4167 3.33325 16.6667 3.33325 13.0833Z"
												stroke="white" stroke-width="2.5"/>
											<path
												d="M5.83325 16.6666L8.18325 31.0666C8.71658 34.3 9.99992 36.6666 14.7666 36.6666H24.8166C29.9999 36.6666 30.7666 34.4 31.3666 31.2666L34.1666 16.6666"
												stroke="white" stroke-width="2.5" stroke-linecap="round"/>
										</svg>

									</a>
								</div>
							</div>
						</div>
						<div class="tab-content" id="tab3">
							<div class="c-slider-cell w-100 txt-center color-white u-flex items-center space-between">
								<div class="c-hero__img">
									<img src="<?php echo get_template_directory_uri(); ?>/assets/images/battery.png"
										 alt="برقآپ">
								</div>
								<div class="c-hero__desc u-flex--column u-flex gap-md items-center">
									<h2 class="sec-title u-flex u-flex--column gap-sm m-0">
								<span class="txt-before u-flex items-center">
									بـــــــرق آپـــــــــــــــــــــــ
									<img src="<?php echo get_template_directory_uri(); ?>/assets/images/txt-before.svg"
										 alt="برقآپ">
								</span>
										مارکــــــــــــت
										مــحــصـــــــولات و تــولـیـــــــــدات مـــا
									</h2>
									<p class="txt-justify">
										سطرآنچنان که لک است، و برای شرایطو سطرآنچنان که لک است،سطرآنچنان که لک است،لک
										است،سطرآنچنان که لک است، و برای شرایط فعلی ت ن و سطرآنچنان
									</p>
									<img
										src="<?php echo get_template_directory_uri(); ?>/assets/images/mockup-website.png"
										alt="برقآپ">
									<a class="secondary-btn border-radius u-flex items-center gap-sm" href="#">
										ورود به سامانه
										<svg width="24" height="24" viewBox="0 0 40 40" fill="none"
											 xmlns="http://www.w3.org/2000/svg">
											<path
												d="M14.1666 23.75C14.1666 26.95 16.8 29.5833 20 29.5833C23.2 29.5833 25.8333 26.95 25.8333 23.75"
												stroke="white" stroke-width="2.5" stroke-miterlimit="10"
												stroke-linecap="round" stroke-linejoin="round"/>
											<path d="M14.6834 3.33325L8.65002 9.38325" stroke="white" stroke-width="2.5"
												  stroke-miterlimit="10" stroke-linecap="round"
												  stroke-linejoin="round"/>
											<path d="M25.3167 3.33325L31.35 9.38325" stroke="white" stroke-width="2.5"
												  stroke-miterlimit="10" stroke-linecap="round"
												  stroke-linejoin="round"/>
											<path
												d="M3.33325 13.0833C3.33325 10 4.98325 9.75 7.03325 9.75H32.9666C35.0166 9.75 36.6666 10 36.6666 13.0833C36.6666 16.6667 35.0166 16.4167 32.9666 16.4167H7.03325C4.98325 16.4167 3.33325 16.6667 3.33325 13.0833Z"
												stroke="white" stroke-width="2.5"/>
											<path
												d="M5.83325 16.6666L8.18325 31.0666C8.71658 34.3 9.99992 36.6666 14.7666 36.6666H24.8166C29.9999 36.6666 30.7666 34.4 31.3666 31.2666L34.1666 16.6666"
												stroke="white" stroke-width="2.5" stroke-linecap="round"/>
										</svg>

									</a>
								</div>
							</div>
						</div>
					</div>
				</div>
			</div>
		</div>
	</div>
</section>

<script>
	const tabButtons = document.querySelectorAll(".tab-btn");
	const tabContents = document.querySelectorAll(".tab-content");

	tabButtons.forEach((btn) => {
		btn.addEventListener("click", () => {
			const target = btn.getAttribute("data-tab");

			// حذف اکتیو از همه
			tabButtons.forEach((b) => b.classList.remove("active"));
			tabContents.forEach((content) => {
				content.classList.remove("active");
			});

			// فعال کردن تب انتخاب‌شده
			btn.classList.add("active");
			document.getElementById(target).classList.add("active");
		});
	});

</script>
